{
  "scrapedAt": "2026-02-17T07:43:02.872Z",
  "businessName": "Axxess",
  "overallRating": 4.5,
  "totalReviews": 5643,
  "scrapedCount": 8,
  "dataId": "0x1e7ad23632467f91:0x57bec90a7dc50866",
  "reviews": [
    {
      "id": "GR-10000",
      "createdAt": "2025-11-28T09:22:34Z",
      "source": "Google",
      "rating": 1,
      "sentiment": "Negative",
      "status": "Flagged (Negative)",
      "agent": "Unknown",
      "team": "Unknown",
      "theme": "Great support",
      "keywords": [
        "good"
      ],
      "tvSnippet": "We bought a Grandstream handset from Axxess and it’s BEEN giving us problem for YEARS UPON YEARS. We tried to contact Ax...",
      "text": "We bought a Grandstream handset from Axxess and it’s BEEN giving us problem for YEARS UPON YEARS. We tried to contact Axxcess to help us with this issue and the phone will receive phone calls for one day and the next day back to not working! It is affecting our business!! This is one of the emails I sent to them:\n\nGood morning,\n\nI hope this email finds you well. We have a SERIOUS ISSUE with your Grandstream handset that we should be using to receive phone calls but instead it does not ring and we only can make phone calls with it. I called your helpline 3 weeks back and spoke to numerous call centre agents and none of them managed to help. A specific agent I spoke to was a lady named Ntombi who managed to get the phone to ring for only one day then after that, it stopped working. I am not the only one from my company who has tried resolving this matter. It has been years upon years with us battling with this particular problem and Axxesss not hearing our demands for a service we pay every month for. We are losing valuable customers because of this and if this continues, we will have to cancel our service with Axxess and get better service and help elsewhere. On July the 11th at 3:31pm one of my co workers sent you the same query message that I am sending today and you did not respond to her email. I have called your helpline more than 15 times and I was put on hold for over 45 mins and they took down my number and said they will call me back but to this day, no one has called me yet. This problem has to be solved, enough is enough!",
      "reviewerName": "Natasha Mhlanga",
      "reviewerLink": "https://www.google.com/maps/contrib/112758278157978820783?hl=en-US",
      "reviewerThumbnail": "https://lh3.googleusercontent.com/a-/ALV-UjXTjTK2GDU7XJHimAHr43lKUHhwqbAEOEK0hCqg3QBZAvBl1UX4=s120-c-rp-mo-ba2-br100",
      "likes": 0
    },
    {
      "id": "GR-10001",
      "createdAt": "2025-12-18T19:38:03Z",
      "source": "Google",
      "rating": 1,
      "sentiment": "Negative",
      "status": "Flagged (Negative)",
      "agent": "Unknown",
      "team": "Unknown",
      "theme": "Fast service",
      "keywords": [
        "customer feedback"
      ],
      "tvSnippet": "I have been paying R499/R599 a month for speeds not exceeding 4MB/ps but the package I was on says 75MB/ps, LMAO. See at...",
      "text": "I have been paying R499/R599 a month for speeds not exceeding 4MB/ps but the package I was on says 75MB/ps, LMAO. See attached screenshots with MTN BUSINESS. I have now cancelled with Axxess. I logged numerous calls but to no avail, seems Axxess/MTN was throttling my speed without being close to the FUP.",
      "reviewerName": "Zubair Khan",
      "reviewerLink": "https://www.google.com/maps/contrib/117416679669828803862?hl=en-US",
      "reviewerThumbnail": "https://lh3.googleusercontent.com/a/ACg8ocIyRNWKaKyQWD9ys1C5dwmM6yLqpEenZ_ylV6-wL7DkGDKsmw=s120-c-rp-mo-ba2-br100",
      "likes": 0
    },
    {
      "id": "GR-10002",
      "createdAt": "2025-12-12T07:55:31Z",
      "source": "Google",
      "rating": 5,
      "sentiment": "Positive",
      "status": "Pending",
      "agent": "Unknown",
      "team": "Unknown",
      "theme": "Great support",
      "keywords": [
        "great",
        "amazing",
        "helpful",
        "professional",
        "quick"
      ],
      "tvSnippet": "I had an amazing experience with Xhanti from the Axxess hosting department. His service was professional, quick, and ver...",
      "text": "I had an amazing experience with Xhanti from the Axxess hosting department. His service was professional, quick, and very helpful. He took the time to understand my issue and made sure everything was resolved smoothly.\n\nThank you, Xhanti, for the great service.",
      "reviewerName": "Letlhakga Projects",
      "reviewerLink": "https://www.google.com/maps/contrib/116202281281285065186?hl=en-US",
      "reviewerThumbnail": "https://lh3.googleusercontent.com/a/ACg8ocKsbgBpNXjrhsxXZclSri7PAh-y7KJQ8wmaCks2zOyb3m24LQ=s120-c-rp-mo-br100",
      "likes": 0
    },
    {
      "id": "GR-10003",
      "createdAt": "2026-01-14T12:04:03Z",
      "source": "Google",
      "rating": 5,
      "sentiment": "Positive",
      "status": "Pending",
      "agent": "Unknown",
      "team": "Unknown",
      "theme": "Fast service",
      "keywords": [
        "quick"
      ],
      "tvSnippet": "Spoke to a dude named Jared via the Axxess desktop app. Very efficient and quick response time. Didn't give me a run aro...",
      "text": "Spoke to a dude named Jared via the Axxess desktop app. Very efficient and quick response time. Didn't give me a run around or a hard time regarding cancellation (due to moving, not service related) and answered my host of questions in about 5 minutes. More businesses need this. Well done Axxess and thanks Jared",
      "reviewerName": "Nicolas Lorenzo",
      "reviewerLink": "https://www.google.com/maps/contrib/114737888662370221630?hl=en-US",
      "reviewerThumbnail": "https://lh3.googleusercontent.com/a-/ALV-UjUJIVRvmRx4PW-i1CgHFKKV06gg2YzZWfORv2SU6YHaCfJx4F5f=s120-c-rp-mo-ba6-br100",
      "likes": 0
    },
    {
      "id": "GR-10004",
      "createdAt": "2025-11-07T06:45:31Z",
      "source": "Google",
      "rating": 1,
      "sentiment": "Negative",
      "status": "Flagged (Negative)",
      "agent": "Unknown",
      "team": "Unknown",
      "theme": "Fast service",
      "keywords": [
        "fast",
        "good",
        "slow"
      ],
      "tvSnippet": "Axxess will lure you in with a promise that they do not believe in contracts and that your subscription with them is on ...",
      "text": "Axxess will lure you in with a promise that they do not believe in contracts and that your subscription with them is on a month-to-month basis and that you can cancel at any time should you not be happy with their services.\n\nThey promise ultra fast internet speeds: \"Say goodbye to buffering and slow speeds\". However, I got EXTREMELY frustrated with VERY slow internet speeds. This was resolved within two days, and I decided to pay my monthly fee of R425-00. However, the next day I was back to \"snail pace\" internet speeds. After only a week with them, I decided to cancel my subscription.\n\nI distinctly remembered reading the following on their website:\nTheir answer to the question \"Do I need to sign up for a contract?\" reads as follows: \"No siree! At Axxess, we don't like contracts. All our services are month-to-month and can be easily cancelled if you change your mind.\"\n\nBUT, when I tried to cancel my internet subscription with Axxess, I was informed I had to pay a cancellation fee of R499-00 should I decide to cancel within the first 6 months after joining them.\n\nWhen I went back to their web site to read the small print, I saw the following sentence: \"*Cancellation fees may apply if signing up on a Promotional offer.\" I did not sign up for a promotional offer, but STILL they charge a cancellation fee?!? SHARKS!!!",
      "reviewerName": "Hannetjie van der Post",
      "reviewerLink": "https://www.google.com/maps/contrib/104740550970257845589?hl=en-US",
      "reviewerThumbnail": "https://lh3.googleusercontent.com/a-/ALV-UjXWu3C5jKofp5D8TbmsqCppqqkV5TxcZZEpS_YHjck-qxpV28mW=s120-c-rp-mo-ba3-br100",
      "likes": 0
    },
    {
      "id": "GR-10005",
      "createdAt": "2025-10-19T11:34:08Z",
      "source": "Google",
      "rating": 5,
      "sentiment": "Positive",
      "status": "Pending",
      "agent": "Unknown",
      "team": "Unknown",
      "theme": "Fast service",
      "keywords": [
        "excellent",
        "reliable"
      ],
      "tvSnippet": "Axxess provides reliable fibre services with excellent speed and uptime, and minimal interruptions. Their fibre packages...",
      "text": "Axxess provides reliable fibre services with excellent speed and uptime, and minimal interruptions. Their fibre packages are well-regarded for their consistent speeds and no downtime. I love that their pricing is competitive, and I can roll over my unused CallTime for up to three months. The setup process was simple, and their app works perfectly for managing calls. Overall, Axxess is a solid choice for home users and small businesses prioritizing affordability, flexibility, and seamless communication backed by reliable fibre connectivity.",
      "reviewerName": "Portia Mthanti",
      "reviewerLink": "https://www.google.com/maps/contrib/102205754145805257168?hl=en-US",
      "reviewerThumbnail": "https://lh3.googleusercontent.com/a-/ALV-UjVJ-NLyphYhZhXDt7EjKYJwLg69bVlnvewH5xkubVGBT1LUTIDv=s120-c-rp-mo-br100",
      "likes": 0
    },
    {
      "id": "GR-10006",
      "createdAt": "2025-12-14T16:14:06Z",
      "source": "Google",
      "rating": 1,
      "sentiment": "Negative",
      "status": "Flagged (Negative)",
      "agent": "Unknown",
      "team": "Unknown",
      "theme": "Needs improvement",
      "keywords": [
        "customer feedback"
      ],
      "tvSnippet": "I used to think Axxess was one of the better ISP's out there and used to be happy with their service, but I have grown e...",
      "text": "I used to think Axxess was one of the better ISP's out there and used to be happy with their service, but I have grown extremely disappointed in their customer service. They have certainly gone backwards. I now have 2 unresolved tickets that no one even bothers to reply to even when I follow up. Not mentioning their chats where the agents simply drop you. This on top of me experiencing intermittent connectivity and logging faults and complaints. Going on for months now. The only thing keeping me from cancelling was a glimmer of faith in past performance but sadly all trust and confidence have now dissipated. They are officially worse than Telkom and I'll be switching to another ISP.",
      "reviewerName": "Derick van Rooyen",
      "reviewerLink": "https://www.google.com/maps/contrib/108656550585584488234?hl=en-US",
      "reviewerThumbnail": "https://lh3.googleusercontent.com/a-/ALV-UjVCAJux5trpNLXQBywbVj7lbN3EFS-XhAF1q9SWnKAQDTSK6jc=s120-c-rp-mo-br100",
      "likes": 0
    },
    {
      "id": "GR-10007",
      "createdAt": "2025-12-01T12:33:51Z",
      "source": "Google",
      "rating": 5,
      "sentiment": "Positive",
      "status": "Pending",
      "agent": "Unknown",
      "team": "Unknown",
      "theme": "Fast service",
      "keywords": [
        "quick",
        "good"
      ],
      "tvSnippet": "A big thank you to Chrizell at Axxess. You guys have been wonderful, quick to respond, quick to resolve issues, and easy...",
      "text": "A big thank you to Chrizell at Axxess. You guys have been wonderful, quick to respond, quick to resolve issues, and easy to get hold of.\nHaving dealt with other providers before, you guys have been a breath of fresh air. Keep up the good work.",
      "reviewerName": "deon van der merwe",
      "reviewerLink": "https://www.google.com/maps/contrib/113306446209086400510?hl=en-US",
      "reviewerThumbnail": "https://lh3.googleusercontent.com/a-/ALV-UjV8XYCVm96ynsv5CIsEmjESHGkyJKizzlkNz-cbX6SP6aV4H-6Z=s120-c-rp-mo-br100",
      "likes": 0
    }
  ]
}